tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "instrumenta/instrumenta"
tap "mongodb/brew"
tap "nektos/tap"
tap "universal-ctags/universal-ctags"
brew "ack"
brew "asdf"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "awscli"
brew "bash"
brew "bat"
brew "brew-cask-completion"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "ctags"
brew "diff-so-fancy"
brew "dive"
brew "docker-compose"
brew "docker-machine"
brew "git"
brew "git-flow-avh"
brew "github/gh/gh"
brew "go"
brew "helm"
brew "hub"
brew "instrumenta/instrumenta/kubeval"
brew "jq"
brew "jsdoc3"
brew "jsonpp"
brew "mongodb/brew/mongocli"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-database-tools"
brew "nmap"
brew "node"
brew "nvm"
brew "pkg-config"
brew "postgresql"
brew "prettier"
brew "pypy"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruby-build"
brew "rustup-init"
brew "shfmt"
brew "speedtest-cli"
brew "ssh-copy-id", link: true
brew "stow"
brew "terminal-notifier"
brew "terraform"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "wdiff"
brew "wget"
brew "wimlib"
brew "wiredtiger"
brew "yarn"
brew "zlib"
cask "1password-cli"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-hack"
cask "font-input"
cask "font-inter"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "font-jetbrainsmono-nerd-font"
cask "font-monoid"
cask "font-office-code-pro"
cask "font-victor-mono"
cask "google-cloud-sdk"
cask "grammarly"
cask "hyperdock"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mongodb"
cask "monodraw"
cask "notion"
cask "slack"
cask "spotify"
cask "typeface"
cask "visual-studio-code"
cask "zoomus"