# Homebrew Taps - Third-party repositories for Homebrew formulas
tap "github/gh" # GitHub CLI extension
tap "homebrew/bundle" # Bundler for Homebrew, Homebrew Cask and the Mac App Store
tap "homebrew/cask" # Alternate formulae for the Homebrew package manager
tap "homebrew/cask-drivers" # Casks for drivers
tap "homebrew/cask-fonts" # Font casks for Homebrew
tap "homebrew/core" # Core formulae for the Homebrew package manager
tap "instrumenta/instrumenta" # Tools for working with Kubernetes and OpenAPI
tap "mongodb/brew" # MongoDB formulae for Homebrew
tap "nektos/tap" # Tools for cloud and container workflows
tap "universal-ctags/universal-ctags" # Maintained ctags implementation

# Development Tools and Utilities - Command-line tools and utilities for development
brew "awscli" # Amazon Web Services command-line interface
brew "bash" # Bourne Again SHell, a UNIX command interpreter
brew "bat" # A cat(1) clone with syntax highlighting and Git integration
brew "brew-cask-completion" # Bash completion for Homebrew Cask
brew "cmake" # Cross-platform make system
brew "colordiff" # Tool to colorize 'diff' output
brew "ctags" # Reimplementation of ctags(1)
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "dive" # Tool for exploring a docker image, layer contents, and discovering ways to shrink the size of your Docker/OCI image
brew "docker-compose" # Isolated development environments using Docker
brew "docker-machine" # Create Docker hosts locally and on cloud providers
brew "git" # Distributed revision control system
brew "git-flow-avh" # Extensions to follow Vincent Driessen's branching model
brew "github/gh/gh" # GitHub command-line tool
brew "go" # The Go programming language
brew "helm" # The Kubernetes package manager
brew "hub" # Add GitHub support to git on the command-line
brew "instrumenta/instrumenta/kubeval" # Tool for validating Kubernetes YAML or JSON configuration files
brew "jq" # Lightweight and flexible command-line JSON processor
brew "jsdoc3" # API documentation generator for JavaScript
brew "jsonpp" # JSON pretty printer
brew "mongodb/brew/mongocli" # MongoDB command-line tool
brew "mongodb/brew/mongodb-community" # MongoDB document databases
brew "mongodb/brew/mongodb-database-tools" # MongoDB tools for high-speed data import and export, data backup, and restoration
brew "nmap" # Network exploration tool and security / port scanner
brew "node" # Platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications
brew "nvm" # Manage multiple Node.js versions
brew "pkg-config" # Manage compile and link flags for libraries
brew "postgresql" # Object-relational database system
brew "prettier" # Opinionated code formatter
brew "pypy" # Highly performant implementation of Python 2 and 3
brew "redis" # Persistent key-value database, with built-in net interface
brew "rename" # Perl-powered file rename script with many helpful built-ins
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rsync" # Utility that provides fast incremental file transfer
brew "ruby-build" # Install various Ruby versions and implementations
brew "speedtest-cli" # Command-line interface for testing internet bandwidth using speedtest.net
brew "ssh-copy-id", link: true # Add a public key to a remote machine's authorized_keys file
brew "terraform" # Tool for building, changing, and versioning infrastructure safely and efficiently
brew "vim" # Vi 'workalike' with many additional features
brew "wdiff" # Display word differences between text files
brew "wget" # Internet file retriever
brew "yarn" # JavaScript package manager
brew "zlib" # General-purpose lossless data-compression library

# Fonts - Various fonts, mostly used for coding and UI design
cask "font-fira-code" # Monospaced font with programming ligatures
cask "font-hack" # Typeface designed for source code
cask "font-input" # Flexible system of fonts designed specifically for code
cask "font-inter" # Typeface carefully crafted for computer screens
cask "font-iosevka" # Slender monospace sans-serif and slab-serif typeface
cask "font-iosevka-slab" # Slab-serif variant of Iosevka
cask "font-jetbrainsmono-nerd-font" # Developer-focused font with ligatures
cask "font-monoid" # Customizable, minimal, and legible font for coding
cask "font-office-code-pro" # Customized version of Source Code Pro
cask "font-victor-mono" # Open-source monospaced font with optional cursive italics

# Applications - GUI applications and tools
cask "1password-cli" # Command-line interface for 1Password
cask "discord" # Voice and text chat software
cask "docker" # App to build and share containerized applications and microservices
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud
cask "grammarly" # Writing assistant software
cask "hyperdock" # Window management features
cask "istat-menus" # Advanced system monitor for macOS
cask "iterm2" # Terminal emulator for macOS
cask "jetbrains-toolbox" # Manage JetBrains tools and projects
cask "mongodb" # NoSQL database program
cask "monodraw" # Powerful ASCII art editor designed for the Mac
cask "notion" # All-in-one workspace for notes, tasks, wikis, and databases
cask "slack" # Team communication and collaboration software
cask "spotify" # Digital music service
cask "typeface" # Font management app
cask "visual-studio-code" # Source-code editor
cask "zoomus" # Video communication and virtual meeting platform
